//Створити рекурсивну функцію, яка отримує числа, зчитуючи їх з клавіатури, і перевіряє їх на непарність. Кінець вводу - число 0. Функція не повертає значення, а відразу ж виводить результат на екран, зберігаючи порядок ведених чисел. У цьому завданні не можна використовувати глобальні змінні і передавати будь-які аргументи в рекурсивну функцію. Основна програма повинна складатися тільки з виклику цієї функції. Контрольний тест: введені числа 3 2 1 0, отриманий результат: 3 1.

#include <iostream>

using namespace std;

void worker() {
    int number;
    cin >> number;
    if (number == 0) {
        return;
    }
    else if (number % 2 != 0) {
        cout << number << " ";
    }
    worker();
}

int main() {
    worker();
}
   